In [177]:
import pandas as pd
import numpy as np

In [178]:
df = {'A':['koo','koo','koo','koo','koo','ree','ree','ree','ree'],
     'B':['Na','Na','Na','Ni','Ni','Na','Na','Ni','Ni'],
     'C':['masaka','orraa','orraa','masaka','masaka','orraa','masaka','masaka','orraa'],
     'D': [1,2,2,3,3,4,5,6,7],
     'E':[2,4,5,5,6,6,8,9,1]}

In [179]:
df = pd.DataFrame(df)
df

     A   B       C  D  E
0  koo  Na  masaka  1  2
1  koo  Na   orraa  2  4
2  koo  Na   orraa  2  5
3  koo  Ni  masaka  3  5
4  koo  Ni  masaka  3  6
5  ree  Na   orraa  4  6
6  ree  Na  masaka  5  8
7  ree  Ni  masaka  6  9
8  ree  Ni   orraa  7  1

In [180]:
pd.pivot_table(df, values='D', index=['B', 'A'], columns=['C'], aggfunc='sum')

C       masaka  orraa
B  A
Na koo     1.0    4.0
   ree     5.0    4.0
Ni koo     6.0    NaN
   ree     6.0    7.0

In [183]:
haha = df.values
haha

array([['koo', 'Na', 'masaka', 1, 2],
       ['koo', 'Na', 'orraa', 2, 4],
       ['koo', 'Na', 'orraa', 2, 5],
       ['koo', 'Ni', 'masaka', 3, 5],
       ['koo', 'Ni', 'masaka', 3, 6],
       ['ree', 'Na', 'orraa', 4, 6],
       ['ree', 'Na', 'masaka', 5, 8],
       ['ree', 'Ni', 'masaka', 6, 9],
       ['ree', 'Ni', 'orraa', 7, 1]], dtype=object)

In [184]:
haha?